    Pandas

        Series

In [2]:
import numpy as np
import pandas as pd

In [4]:
indeces = ['a', 'b', 'c']
lst = [10, 20, 30]
dct = {'a' : 10, 'b' : 20, 'c' :30}
arr = np.array(lst)

In [8]:
pd.Series(lst)

0    10
1    20
2    30
dtype: int64

In [9]:
pd.Series(lst, index= indeces)

a    10
b    20
c    30
dtype: int64

In [5]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int64

In [6]:
pd.Series(arr, index= indeces)

a    10
b    20
c    30
dtype: int64

In [7]:
pd.Series(dct)

a    10
b    20
c    30
dtype: int64

        DataFrames

In [10]:
from numpy.random import randn

In [11]:
np.random.seed(101)

In [12]:
df = pd.DataFrame(randn(5,4),['a','b','c','d','e'],['w','x','y','z'])

In [13]:
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [20]:
df['w']

a    2.706850
b    0.651118
c   -2.018168
d    0.188695
e    0.190794
Name: w, dtype: float64

In [32]:
df[['w','x','y']]

          w         x         y
a  2.706850  0.628133  0.907969
b  0.651118 -0.319318 -0.848077
c -2.018168  0.740122  0.528813
d  0.188695 -0.758872 -0.933237
e  0.190794  1.978757  2.605967

In [21]:
type(df['w'])

pandas.core.series.Series

In [22]:
type(df)

pandas.core.frame.DataFrame

In [24]:
df['new'] = df['w'] + df['y']

In [26]:
df['new']

a    3.614819
b   -0.196959
c   -1.489355
d   -0.744542
e    2.796762
Name: new, dtype: float64

In [28]:
df.drop('new', axis= 1, inplace=True) # inplace is there as two step verification saying are you sure to drop

In [29]:
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [30]:
df.drop('e') # by default axis = 0 means row ; axis = 1 means columnwise

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057

In [31]:
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [36]:
#Selecting Rows..

df.loc['a']

w    2.706850
x    0.628133
y    0.907969
z    0.503826
Name: a, dtype: float64

In [37]:
df.iloc[0]

w    2.706850
x    0.628133
y    0.907969
z    0.503826
Name: a, dtype: float64

In [38]:
df.loc['a','y']

np.float64(0.9079694464765431)

In [41]:
df.loc[['b','c','d'],['x','y']]

          x         y
b -0.319318 -0.848077
c  0.740122  0.528813
d -0.758872 -0.933237

In [42]:
df > 0

       w      x      y      z
a   True   True   True   True
b   True  False  False   True
c  False   True   True  False
d   True  False  False   True
e   True   True   True   True

In [45]:
df[df > 0]

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118       NaN       NaN  0.605965
c       NaN  0.740122  0.528813       NaN
d  0.188695       NaN       NaN  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [47]:
df['w'] > 0

a     True
b     True
c    False
d     True
e     True
Name: w, dtype: bool

In [46]:
df[df['w'] > 0]

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [48]:
df[df['z'] < 0]

          w         x         y         z
c -2.018168  0.740122  0.528813 -0.589001

In [49]:
df[df['w'] > 0]['y']

a    0.907969
b   -0.848077
d   -0.933237
e    2.605967
Name: y, dtype: float64

In [52]:
df[df['y'] < 0][['x','y','z']]

          x         y         z
b -0.319318 -0.848077  0.605965
d -0.758872 -0.933237  0.955057

In [54]:
df[(df['x'] > 0) and (df['y'] < 0)]

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [55]:
df[(df['x'] > 0) & (df['y'] < 0)][['x','y']]

Empty DataFrame
Columns: [x, y]
Index: []

In [59]:
df[(df['x'] < 0) | (df['y'] < 0)][['x','y','z']]

          x         y         z
b -0.319318 -0.848077  0.605965
d -0.758872 -0.933237  0.955057

In [56]:
df[(df['x'] < 0) & (df['y'] < 0)][['x','y','z']]

          x         y         z
b -0.319318 -0.848077  0.605965
d -0.758872 -0.933237  0.955057

In [61]:
df.reset_index()

  index         w         x         y         z
0     a  2.706850  0.628133  0.907969  0.503826
1     b  0.651118 -0.319318 -0.848077  0.605965
2     c -2.018168  0.740122  0.528813 -0.589001
3     d  0.188695 -0.758872 -0.933237  0.955057
4     e  0.190794  1.978757  2.605967  0.683509

In [62]:
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [63]:
new_index = 'ab cd ef gh ij'.split()

# ['a','b','c','d','e']

In [64]:
df.set_index(new_index)

KeyError: "None of ['ab', 'cd', 'ef', 'gh', 'ij'] are in the columns"

In [65]:
df['nw_ind'] = new_index

In [67]:
df.set_index('nw_ind')

               w         x         y         z
nw_ind
ab      2.706850  0.628133  0.907969  0.503826
cd      0.651118 -0.319318 -0.848077  0.605965
ef     -2.018168  0.740122  0.528813 -0.589001
gh      0.188695 -0.758872 -0.933237  0.955057
ij      0.190794  1.978757  2.605967  0.683509

In [68]:
df

          w         x         y         z nw_ind
a  2.706850  0.628133  0.907969  0.503826     ab
b  0.651118 -0.319318 -0.848077  0.605965     cd
c -2.018168  0.740122  0.528813 -0.589001     ef
d  0.188695 -0.758872 -0.933237  0.955057     gh
e  0.190794  1.978757  2.605967  0.683509     ij

In [71]:
#Index Levels
outside = ['G1', 'G1', 'G1', 'G2', 'G2', 'G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside, inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [72]:
df = pd.DataFrame(randn(6,2), hier_index, ['A', 'B'])

In [73]:
df

             A         B
G1 1  1.133703  0.528187
   2  0.393461 -0.630507
   3 -1.398290 -0.219311
G2 1 -0.045676  0.012421
   2  0.093628  1.240813
   3 -1.097693 -1.908009

In [75]:
# df.loc['G1']
df.loc['G1'].loc[1]

A    1.133703
B    0.528187
Name: 1, dtype: float64

In [79]:
df.index.names = ['Groups', 'Numbers']

In [80]:
df

                       A         B
Groups Numbers
G1     1        1.133703  0.528187
       2        0.393461 -0.630507
       3       -1.398290 -0.219311
G2     1       -0.045676  0.012421
       2        0.093628  1.240813
       3       -1.097693 -1.908009

        Missing Data

In [99]:
dct_1 = {'A' : [1,2,np.nan], 'B' : [5,np.nan,np.nan], 'C' : [1,2,3]}

In [100]:
dct_1

{'A': [1, 2, nan], 'B': [5, nan, nan], 'C': [1, 2, 3]}

In [101]:
df = pd.DataFrame(dct_1)

In [102]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [103]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [105]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [106]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [107]:
df.fillna(value='fill')

      A     B  C
0   1.0   5.0  1
1   2.0  fill  2
2  fill  fill  3

In [108]:
df['A'].fillna(value= df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

        GroupBy
                It allows you to group together rows based off of a column and perform an aggregate function on them

In [109]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [110]:
df = pd.DataFrame(data)

In [111]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [114]:
by_comp = df.groupby('Company')

In [116]:
by_comp['Sales'].mean()

Company
FB      296.5
GOOG    160.0
MSFT    232.0
Name: Sales, dtype: float64

In [118]:
df.groupby('Company')['Sales'].mean()

Company
FB      296.5
GOOG    160.0
MSFT    232.0
Name: Sales, dtype: float64

In [119]:
df.groupby('Company').sum('Sales')

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [128]:
df.groupby('Company').sum('Sales').loc['MSFT']

Sales    464
Name: MSFT, dtype: int64

In [129]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

        Operations

In [3]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [4]:
df['col2'].unique()

array([444, 555, 666])

In [7]:
# len(df['col2'].unique())

df['col2'].nunique()

3

In [8]:
df['col2'].value_counts()

col2
444    2
555    1
666    1
Name: count, dtype: int64

In [9]:
df[df['col2'].unique()]

KeyError: "None of [Index([444, 555, 666], dtype='int64')] are in the [columns]"

In [10]:
def sqrd(x):
    return x ** 2

In [11]:
df['col1'].apply(sqrd)

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

In [12]:
df['col1'].apply(lambda x: x ** 2)

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

In [16]:
# df['col3'].apply(lambda x: len(x)) 

df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [18]:
df.sort_values('col2', ascending=False)

   col1  col2 col3
2     3   666  ghi
1     2   555  def
0     1   444  abc
3     4   444  xyz

In [19]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [20]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data=data)

In [21]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [22]:
df.pivot_table(values='D',index= ['A', 'B'] ,columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

        Inputs and Outputs

In [25]:
path = 'C:/Users/2165362/OneDrive - Cognizant/Desktop/Programmes/Python/Python/complete-pandas-tutorial/data/'

In [26]:
pd.read_csv( path + 'bios.csv')

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25
...,...,...,...,...,...,...,...,...,...,...
145495,149222,Polina Luchnikova,2002-01-30,Serov,Sverdlovsk,RUS,ROC,167.0,61.0,NaN
145496,149223,Valeriya Merkusheva,1999-09-20,Moskva (Moscow),Moskva,RUS,ROC,168.0,65.0,NaN
145497,149224,Yuliya Smirnova,1998-05-08,Kotlas,Arkhangelsk,RUS,ROC,163.0,55.0,NaN
145498,149225,André Foussard,1899-05-19,Niort,Deux-Sèvres,FRA,France,166.0,NaN,1986-03-18
145499,149814,Bill Phillips,1913-07-15,Dulwich Hill,New South Wales,AUS,Australia,NaN,NaN,2003-10-20